content/posts/lodema-sackett.md
---
title: "Lodema Sackett"
date: 2015-11-12T14:53:00-05:00
tags: ["sackett", "familytree", "newspaper"]
draft: false
description: "An interview from 1817 about being a school teacher in Ohio"
---

## Lodema Sackett {#lodema-sackett}

{{< figure_cloudflare src="lodemia-sackett" title="Lodema Sackett picture" >}}

Lodema Sackett, my fourth great aunt, lived from 1788 to 1889 in Ohio. She was interviewed in 1887 about being a school teacher.

---

In 1817, the "north" school was built on the farm of Judge William Eyles on Akron Road. Other teachers at this time included Sherman Loomis and his wife, Lodema Sackett Loomis, Captain George Lyman, Lemuel North and John Nesmith.

In 1887, Mrs. Loomis gave this recollection of that early school:

> "It was in the year 1819, when Captain George Lyman, father of Dr. Lyman, came to my home in Tallmadge and engaged me to teach school in Wadsworth. I was then twenty-one years old and had considerable experience, as I began teaching > at the age of fifteen. In November of that year, a young man was sent on horseback for me. I rode the horse and he walked by my side--a distance of twenty-one miles.
>
> I boarded at Captain Lyman's, who lived about three-fourths of a mile from the schoolhouse..."

Her wages were one and a half dollars a day and her board. For three months work she earned eighteen dollars. She was paid in corn which was taken to East Akron and made into whiskey. It made a full barrel and was stored in her fathers barn.

When it was sold, three years later, one third of it had disappeared. After considerable investigation they found straws through which someone had obtained the whiskey. In the meantime, the hired man had a terrible sickness which the doctor diagnosed as delirium tremens. Thus the mystery was solved.

{{< figure_cloudflare src="lodemia-loomis-prayer-card" title="Lodema Sackett Prayer Card" >}}

{{< figure_cloudflare src="lodemia-sackett-newspaper" title="Original Newspaper Story" >}}
